Типы оперотивных систем 
	1.	Серверные ОС — управляют ресурсами компьютера и обслуживают множество пользователей в сети.
	2.	Настольные (пользовательские) — предназначены для работы одного пользователя на персональном компьютере.
	3.	Мобильные — используются на смартфонах и планшетах для работы с приложениями, связью и интернетом.
	4.	Встроенные — управляют бытовой техникой, электроникой, автомобилями и другими специализированными устройствами. 
  Еще мы прошли основы ОС
  Операционная система (ОС) — это главная программа компьютера, которая управляет его устройствами и обеспечивает взаимодействие пользователя с техникой.

Основные функции ОС:
	1.	Управление процессором и памятью.
	2.	Организация хранения данных на дисках.
	3.	Запуск и выполнение программ.
	4.	Обеспечение интерфейса для работы пользователя.
	5.	Поддержка связи между компьютером и другими устройствами.
	6.	Защита данных и управление правами доступа.
